// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");
//11.Дано число больше 9. Вывести на экран  вторую цифру числа с конца
int a=256;
int b=a / 10;
System.Console.WriteLine(b % 10);