// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");
//17.Дано число обозначающее день недели. Выяснить является номер дня недели выходным
System.Console.WriteLine("Введите число от 1 до 7 включительно:");
int a=Convert.ToInt32(Console.ReadLine());
if(a>5 && a<8)System.Console.WriteLine("YES");else System.Console.WriteLine("NO");
