// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");
//6.Написать программу вычисления значения функции y = sin(a). (Класс Math). 
double a=Convert.ToDouble(Console.ReadLine());
double y=Math.Sin(a);
System.Console.WriteLine(y);
