// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");
//10.Вывести на экран последнюю цифру целого числа введенного с клавиатуры.
System.Console.WriteLine("введите число a:");
int a=Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine(a % 10);